---
kind: type
id: T:Autodesk.Revit.DB.ViewFamily
source: html/916ed7b6-0a2e-c607-5d35-9ff9303b1f46.htm
---
# Autodesk.Revit.DB.ViewFamily

An enumerated type that corresponds to the type of a Revit view.

## Syntax (C#)
```csharp
public enum ViewFamily
```